cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "ack"
brew "bash-completion"
brew "bat"
brew "coreutils"
brew "dos2unix"
brew "findutils"
brew "fontconfig"
brew "fzf"
brew "gawk"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "httpie"
brew "jq"
brew "libgit2"
brew "mas"
brew "moreutils"
brew "nmap"
brew "node", link: false
brew "nvm"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "ttyrec"
brew "watch"
brew "yarn"
brew "youtube-dl"

cask "1password"
cask "alfred"
cask "backblaze"
cask "bartender"
cask "caffeine"
cask "dash"
cask "datagrip"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "flux"
cask "font-hack"
cask "font-hasklig"
cask "font-source-code-pro"
cask "gpg-suite"
cask "intellij-idea"
cask "iterm2"
cask "little-snitch"
cask "macbreakz"
cask "micro-snitch"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "oracle-jdk"
cask "postman"
cask "signal"
cask "slack"
cask "soapui"
cask "sourcetree"
cask "the-unarchiver"
cask "visual-studio-code"

mas "Chronicle Pro", id: 1280542517
mas "Kaleidoscope", id: 587512244
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "ReadKit", id: 588726889
mas "Things 3", id: 904280696
mas "Ulysses", id: 1225570693
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
