cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "ack"
brew "bash-completion"
brew "coreutils"
brew "dos2unix"
brew "findutils"
brew "fontconfig"
brew "fzf"
brew "gawk"
brew "git"
brew "httpie"
brew "jq"
brew "mas"
brew "moreutils"
brew "nmap"
brew "node", link: false
brew "nvm"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "speedtest-cli"
brew "the_silver_searcher"
brew "tmux"
brew "yarn"

cask "1password"
cask "alfred"
cask "bartender"
cask "cleanmymac"
cask "dash"
cask "datagrip"
cask "font-hack"
cask "font-hasklig"
cask "font-source-code-pro"
cask "the-unarchiver"
cask "visual-studio-code"

mas "Kaleidoscope", id: 587512244
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
